uhnp/src/Catalogs/ПравилаПроверки/ПравилаПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПроверки</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <owners>Catalog.ШаблоныКорректировокЗначенийПоказателей</owners>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстанавливатьсяПриОшибке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтролируемыеПоказателиОтчетов</name>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьСтрокиАналитическогоРаскрытия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьСинтетическиеЗначения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокУстранения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньКритичности</name>
      <type>
        <types>EnumRef.УровниКритичностиКонтрольныхСоотношений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ТипыЗначенийПоказателейОтчетов/ТипыЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыСравнения/ВидыСравнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСравнения</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>НеРавно</name>
  </enumValues>
  <enumValues>
    <name>НеБольше</name>
  </enumValues>
  <enumValues>
    <name>НеМеньше</name>
  </enumValues>
  <enumValues>
    <name>ВСписке</name>
  </enumValues>
  <enumValues>
    <name>НеВСписке</name>
  </enumValues>
  <enumValues>
    <name>ВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеПоИерархии</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ПоказателиОтчетов/ПоказателиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОтчетов</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутриГрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.КолонкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <comment>Точность отображения показателя не зависит от точности отображения документа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка</name>
    <type>
      <types>CatalogRef.СтрокиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаПоСчету</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКритичности</name>
    <type>
      <types>EnumRef.УровниКритичностиКонтрольныхСоотношений</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОтраженияКурсовыхРазниц</name>
    <comment>//Удалить</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентТР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаИтогаПоПериоду</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателяПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСуммируется</name>
    <comment>Не суммируется при консолидации / свертке значений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролируемыйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КонтролироватьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточныйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитываетсяПослеКонвертации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиДляКурсовВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКурса</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПравилаПроверки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруЗначенийПоУмолчанию(ПоказательОтчета)
	
	СтруктураЗначений=Новый Структура;
	
	Если ПоказательОтчета.ТипЗначения=Перечисления.ТипыЗначенийПоказателейОтчетов.Булево Тогда
		
		СтруктураЗначений.Вставить("КонтрольноеЗначение",Истина);
		
	Иначе
		
		СтруктураЗначений.Вставить("КонтрольноеЗначение",ОбщегоНазначенияУХ.ПолучитьПустоеЗначениеПоТипуПоказателя(ПоказательОтчета.ТипЗначения));
				
	КонецЕсли;
		
	СтруктураЗначений.Вставить("ПроверятьСтрокиАналитическогоРаскрытия",ЗначениеЗаполнено(ПоказательОтчета.ГруппаРаскрытия));
	СтруктураЗначений.Вставить("ПроверятьСинтетическиеЗначения",НЕ СтруктураЗначений.ПроверятьСтрокиАналитическогоРаскрытия);
	СтруктураЗначений.Вставить("ВидСравнения",Перечисления.ВидыСравнения.Равно);
		
	Возврат СтруктураЗначений;
				
КонецФункции // ПолучитьКонтрольноеЗначениеПоУмолчанию() 

&НаСервере 
Процедура ЗаполнитьКонтролируемыеПоказатели()
	
	Объект.КонтролируемыеПоказателиОтчетов.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПоказателиОтчетов.Ссылка КАК ПоказательОтчета,
	|	ПоказателиОтчетов.ГруппаРаскрытия,
	|	ПоказателиОтчетов.Описание,
	|	ПоказателиОтчетов.ПорядокУстранения,
	|	ПоказателиОтчетов.УровеньКритичности
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &Владелец
	|	И ПоказателиОтчетов.Проверочный";
	
	Запрос.УстановитьПараметр("Владелец",Объект.Владелец);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НоваяСтрока=Объект.КонтролируемыеПоказателиОтчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Результат);
		
		СтруктураРеквизитовПоУмолчанию=ПолучитьСтруктуруЗначенийПоУмолчанию(Результат.ПоказательОтчета);
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураРеквизитовПоУмолчанию);
		
	КонецЦикла;
			
КонецПроцедуры // ЗаполнитьКонтролируемыеПоказатели()

&НаКлиенте
Процедура ПоказательОтчетаПриИзменении(Элемент)
		
	СтруктураЗначенийПоУмолчанию=ПолучитьСтруктуруЗначенийПоУмолчанию(Элементы.КонтролируемыеПоказателиОтчетов.ТекущиеДанные.ПоказательОтчета);	
	ЗаполнитьЗначенияСвойств(Элементы.КонтролируемыеПоказателиОтчетов.ТекущиеДанные,СтруктураЗначенийПоУмолчанию);
			
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.КонтролируемыеПоказателиОтчетов.Количество()>0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("Подключаемый_ЗаполнитьКонтролируемыеПоказатели", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Нстр("ru = 'Строки таблицы будут очищены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
        Возврат;
		
	КонецЕсли;
	
	ЗаполнитьКонтролируемыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьКонтролируемыеПоказатели(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда        
        Возврат;        
    КонецЕсли;
    
   	ЗаполнитьКонтролируемыеПоказатели();

КонецПроцедуры
